/******************************************************************************
 Copyright (C) 2010  R&D Institute of HuaCai Co.,Ltd.
 File Name      : Main_Up_Explain.h
 Description    : 
 ------------------------------------------------------------------------------
 Modification History:
 <No.>  <version>       <time>      <author>        <contents>
   1、    1.00        2012-02-05    azh     the original version
******************************************************************************/

/*******************************************************************************/
//该文件用以定义通信转换用结构，在主站上行规约转换中，将下文表示的格式转换成为主站规约中的数据
//的格式
/*******************************************************************************/
#ifndef _MAIN_UP_EXPLAIN_H_
#define _MAIN_UP_EXPLAIN_H_


#endif
